#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>

//int main()
//{
    //算数操作符： /商 %余

	//移位操作符
	/*int a =16;*/  //16的二进制表示00000000000000000000000000010000-16的源码  
	//16的反码：源码的符号位（既第一个数）不变，其他的取反：01111111111111111111111111101111  ；  
	//16的补码 ：反码+1：01111111111111111111111111110000；   
	//>>右移操作符，移动的是二进制位
	// 算数右移：右边最后一位丢弃，左边补原符号位     逻辑右移：右边最后一位丢弃，左边补0
	//int b=a >> 1; //b的二进制表示00000000000000000000000000001000  b= 8    右移一位有/2的效果    
	//printf("%d\n", b);
	//左移：左边丢弃，右边补1
	/*int c = a << 1;
	printf("%d\n", c);*/

	 
	//按二进制位与&（只有两个为1才为1） 或|（有一个为1就是1）   ^异或（相同为0，相异为1）  非！     都是以二进制补码的形式来运算
	//a b 交换 不能创建第三个变量
	//int a = 3;
	//int b = 5;
	////加减法 - 数据可能会溢出
	//{a = a + b;
	//b = a - b;
	//a = a - b; }
	////异或法
	//{a = a ^ b;
	//b = a ^ b;
	//a = a ^ b;
	//}


//赋值操作符=   判断相等==
	//复合赋值符  %=  += -= /= *=

	//单目操作符 !(真假互换)   -(负号)   sizeof求数据类型的大小：字节长度   *解引用操作符   &取地址操作符




//
//	return 0;
//}